[
    {
        "id": "0",
        "category": "Research Article:",
        "date": "Chemistry Select, 5, 13619– 13627, 2020",
        "topic": "On the Biophysical Investigation of Sulfamethazine-Hemoglobin Binding and the Resulting Adverse Effects of Antibiotics",
        "contributer": "Aben Ovung, A. Mavani, Sabyasachi Chatterjee, Abhi Das, Gopinatha Suresh Kumar, Sutanwi Bhuiya, Suman Das and Jhimli Bhattacharyya"
    },
    {
        "id": "1",
        "category": "Research Article:",
        "date": "Journal of Indian Chemical Society, 97, 2667-2672, 2020",
        "topic": "Binding of Hemoglobin and Sulfamethazine through Fluorescence spectroscopy study",
        "contributer": "Aben Ovung, Soching Luikham and Jhimli Bhattacharyya"
    },
    {
        "id": "2",
        "category": "Research Article:",
        "date": "Biophysical Review, 13, 259-272, 2021",
        "topic": "A Review on Sulfonamide Drugs; Sulfamethazine and Sulfadiazine",
        "contributer": "Aben Ovung and Jhimli Bhattacharyya"
    },
    {
        "id": "3",
        "category": "Research Article:",
        "date": "Luminescence, 37, 702-712, 202",
        "topic": "Lysozyme binding with sulfa group of antibiotics: comparative binding thermodynamics and computational study",
        "contributer": "Aben Ovung, Nungshioba Jamir and Jhimli Bhattacharyya"
    },
    {
        "id": "4",
        "category": "Research Article:",
        "date": "Materials Today: Proceedings, 68, 171-176, 2022",
        "topic": "Molecular insight into sulfa antibiotic drug binding with human proteins",
        "contributer": "Aben Ovung, Vibeizonuo Rupreo and Jhimli Bhattacharyya"
    },
    {
        "id": "5",
        "category": "Research Article:",
        "date": "ACS Omega, 7, 4932-4944, 2022",
        "topic": "Heme Protein Binding of Sulfonamide Compounds: A Correlation Study by Spectroscopic, Calorimetric and Computational Methods",
        "contributer": "Aben Ovung, Mavani A, Ambarnil Ghosh, Sabyasachi Chatterjee, Abhi Das, Gopinatha Suresh Kumar, Debes Ray, Vinod K. Aswal and Jhimli Bhattacharyya"
    },
    {
        "id": "6",
        "category": "Research Article:",
        "date": "Chemical Physics Impact, 5, 100087, 2022",
        "topic": "Binding Effects of Antibiotic Drug Sulfamethazine on the Serum Albumins: Multi-Spectroscopic and Computation Approach",
        "contributer": "Aben Ovung and Jhimli Bhattachary"
    },
    {
        "id": "7",
        "category": "Research Article:",
        "date": "International Journal of Chemical and Environmental Sciences, 2, 37-55, 2021",
        "topic": "A brief commentary on activated carbon material as an efficient low-cost material for water decontamination",
        "contributer": "Akito I Sema and Jhimli Bhattacharyya"
    },
    {
        "id": "8",
        "category": "Research Article:",
        "date": "Journal of Indian Chemical Society, 99, 100791, 2022",
        "topic": "Biochar derived from waste bamboo shoots for the biosorptive removal of ferrous ions from aqueous solution",
        "contributer": "Akito I Sema and Jhimli Bhattacharyya"
    },
    {
        "id": "9",
        "category": "Research Article:",
        "date": "International Journal of Biotechnology and Biomedical Sciences, 4, 108-113, 2018",
        "topic": "Elucidation of Binding Interactions between Sulfamethazine and Surfactants to Facilitate Drug Delivery via Drug-Micelle Aggregate Formation",
        "contributer": "A. Mavani, Aben Ovung, Abhijit Kar and Jhimli Bhattacharyya"
    },
    {
        "id": "10",
        "category": "Research Article:",
        "date": "Journal of Surfactants and Detergents, 25, 331-339, 2022",
        "topic": "In-vitro Solubilisation of Antibiotic Drug Sulfamethazine: an Investigation on Drug-Micelle Aggregate Formation by Spectroscopic and Scattering Techniques",
        "contributer": "1A. Mavani, Aben Ovung, Soching Luikham, Debes Ray, Vinod K. Aswal, Sabyasachi Chatterjee, and Jhimli Bhattacharyya"
    },
    {
        "id": "11",
        "category": "Research Article:",
        "date": "Journal of Biomolecular Structure Dynamics, 1-12, 2022",
        "topic": "Biophysical and molecular modelling evidences for the binding of sulfa molecule with haemoglobin”. ",
        "contributer": "A. Mavani, Aben Ovung, Soching Luikham, Gopinatha Suresh Kumar, Abhi Das, Debes Ray, Vinod K. Aswal and Jhimli Bhattacharyya"
    },
    {
        "id": "12",
        "category": "Research Article:",
        "date": "Materials Today: Proceedings, 68, 209-214, 2022",
        "topic": "Unravelling the bio-molecular interaction of plant alkaloid Harmane with CT and HT DNA: A bioinformatics outlook",
        "contributer": "Soching Luikham, Aben Ovung and Jhimli Bhattacha"
    },
    {
        "id": "13",
        "category": "Research Article:",
        "date": "DNA and Cell Biology, 41, 91-102, 2022",
        "topic": "Targeting natural polymeric DNAs with Harmane: an insight into binding and thermodynamic interaction via biophysical approach",
        "contributer": "Soching Luikham and Jhimli Bhattacharyya"
    },
    {
        "id": "14",
        "category": "Research Article:",
        "date": "Luminescence: The Journal of Biological and Chemical Luminescence, 37, 691-701, 2022",
        "topic": "Deciphering binding affinity, energetic, and base specificity of plant alkaloid Harmane with AT and GC hairpin duplex DNA",
        "contributer": "Soching Luikham, Mavani A and Jhimli Bhattacharyya"
    },
    {
        "id": "15",
        "category": "Research Article:",
        "date": "Luminescence: The Journal of Biological and Chemical Luminescence, 97, 1-9, 2022",
        "topic": "Protein-binding characteristics of yohimbine, a natural indole alkaloid-based drug for erectile dysfunction",
        "contributer": "Vibeizonuo Rupreo, Soching Luikham and Jhimli Bhattacharyya"
    },
    {
        "id": "16",
        "category": "Book Chapters:",
        "date": "Elsevier, 2022. ISBN: 978-0-32-389800-3",
        "topic": "'Bacterial infections: anti-microbial mechanism of action and bacterial resistance' in 'Viral, Parasitic, Bacterial, and Fungal Infections: Anti-Microbial, Host Defense and Therapeutic Strategies'",
        "contributer": "Aben Ovung and Jhimli Bhattacharyya"
    },
    {
        "id": "17",
        "category": "Book Chapters:",
        "date": "Taylor and Francis, v2022",
        "topic": "“Comparative assessment of physico-chemical and biological methods for the treatment landfill leachate” in “Toxicity of aquatic system and remediation: The Contemporary Issues”",
        "contributer": "Akito I Sema and Jhimli Bhattacharyya"
    },
    {
        "id": "18",
        "category": "Book Chapters:",
        "date": "2022",
        "topic": "“Remediation of water contaminants: The Biochar perspective’s” in “Education in Chemical science and Technology(Indian Chemical Society)”",
        "contributer": "Akito I Sema and Jhimli Bhattacharyya"
    },
    {
        "id": "19",
        "category": "Book Chapters:",
        "date": "2022",
        "topic": "“Chemistry and mechanism of the diseases caused by digestive disorders” in “Nutrition and functional foods in boosting digestion, metabolism and immune health”",
        "contributer": "Sabyasachi Chatterjee, A. Mavani and Jhimli Bhattacharyya"
    },
    {
        "id": "20",
        "category": "Book Chapters:",
        "date": "2022",
        "topic": "“Role of surfactants in the history of pharmaceutical science: A revolution in drug delivery” in “Education in Chemical Science and Technology, Indian Chemical Society”",
        "contributer": "A.Mavani, Jhimli Bhattacharyya"
    },
    {
        "id": "21",
        "category": "Book Chapters:",
        "date": "Elsevier, 2022. ISBN: 978-0-12-822238-6",
        "topic": "“Gut microbiome, human nutrition and the immunity;visualizing the future” in “Microbiome, Immunity, Digestive Health and Nutrition”. ",
        "contributer": "Soching Luikham and Jhimli Bhattacharyya"
    },
    {
        "id": "22",
        "category": "Book Chapters:",
        "date": "Taylor and Francis, 2022",
        "topic": "“Microbial Boremediation: Importance, features, applications, and future perspectives” in “Toxicity of Aquatic System and Remediation- the Contemporary Issues”. ",
        "contributer": "Soching Luikham and Jhimli Bhattacharyya"
    }
]